html/material/prepare.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>面试准备</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">面试准备</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org073cf6e">Java</a>
<ul>
<li><a href="#orgddc4638">collections</a></li>
<li><a href="#org010842f">concurrency</a></li>
<li><a href="#org174e154">jvm</a></li>
<li><a href="#org953893c">spring</a></li>
</ul>
</li>
<li><a href="#orgfa6a4c3">database</a></li>
<li><a href="#org5362b27">network</a>
<ul>
<li><a href="#org1b1ace4">web</a></li>
<li><a href="#org555722e">nginx</a></li>
<li><a href="#orgb471557">protocal</a></li>
<li><a href="#orgbca60f0">NIO</a></li>
</ul>
</li>
<li><a href="#orgffacc2d">distribution</a>
<ul>
<li><a href="#orgd9f98c4">redis</a></li>
<li><a href="#org0cbc613">db</a></li>
<li><a href="#org2381948">rabbit mq</a></li>
</ul>
</li>
<li><a href="#org44a0556">k8s</a></li>
</ul>
</div>
</div>
<div id="outline-container-org073cf6e" class="outline-2">
<h2 id="org073cf6e">Java</h2>
<div class="outline-text-2" id="text-org073cf6e">
</div>
<div id="outline-container-orgddc4638" class="outline-3">
<h3 id="orgddc4638">collections</h3>
<div class="outline-text-3" id="text-orgddc4638">
<ul class="org-ul">
<li>String,StringBuilder,StringBuffer
<ul class="org-ul">
<li>String因为是不变类，所以拼接效率差</li>
<li>StringBuilder 线程不安全</li>
<li>StringBuffer 线程安全，效率不如 StringBuilder</li>
</ul></li>
<li>hashmap结构：
<ul class="org-ul">
<li>数组：每个数组的元素是一个链表
<ul class="org-ul">
<li>hash冲突：这时候需要全链表搜索</li>
<li>Java8 之后改用 红黑树代替链表，加快搜索速度 O(logn)</li>
</ul></li>
<li>不可变的对象适合做key，比如String，Integer</li>
</ul></li>
<li>hashtable,concurrentHashMap
<ul class="org-ul">
<li>HashTable 全量加锁</li>
<li>ConcurrentyHashMap 分段加锁
<ul class="org-ul">
<li>读取不加锁</li>
<li>写时只有必要的情况才加锁</li>
</ul></li>
</ul></li>
<li>ArrayList和LinkedList 
<ul class="org-ul">
<li>ArrayList 底层是数组，有扩容，随机访问元素快</li>
<li>LinkedList: 底层是链表：添加，删除元素快</li>
</ul></li>
<li>list为什么有序的，set为什么都是无序的：set基于hashset实现，而哈希本身就是无序的</li>
<li>对象的深浅复制：
<ul class="org-ul">
<li>浅拷贝：Object类的clone方法只会拷贝对象中的 <span class="underline">基本的数据类型</span> ，对于 <span class="underline">数组</span> <span class="underline">集合</span> 中的元素、 <span class="underline">引用</span> 对象等都不会拷贝</li>
<li>深拷贝，必须覆写clone方法</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org010842f" class="outline-3">
<h3 id="org010842f">concurrency</h3>
<div class="outline-text-3" id="text-org010842f">
<ul class="org-ul">
<li>wait,sleep分别是谁的方法，区别
<ul class="org-ul">
<li>wait : Object 的方法，释放锁</li>
<li>sleep: Thread的方法，不释放锁</li>
</ul></li>
<li>线程池参数： 任务会被缓存在任务队列 中
<ul class="org-ul">
<li>core线程的数量</li>
<li>max线程的数量：是否有界</li>
<li>超时时间：超过指定时间不用，超过core线程数目的线程会被消耗</li>
<li>线程的饱和策略
<ul class="org-ul">
<li>拒绝执行</li>
<li>扔掉在执行的线程
<ul class="org-ul">
<li>扔掉最新的</li>
<li>扔掉最旧的</li>
</ul></li>
<li>CallerOnPolicy: 在提交任务的线程中执行任务</li>
</ul></li>
</ul></li>
<li>ThreadLocal原理
<ul class="org-ul">
<li>ThreadID 作为 key的哈希表</li>
<li>只能在同一个线程中共享变量</li>
<li>线程结束后必须清空</li>
</ul></li>
<li>还有Java的锁
<ul class="org-ul">
<li>内置锁：synchronized
<ul class="org-ul">
<li>等待期间无法响应中断</li>
<li>只能隐含一个对象，难用</li>
<li>不支持公平锁</li>
<li>操作方便</li>
</ul></li>
<li>显式锁: Lock/RenentraceLock
<ul class="org-ul">
<li>等待期间可以中断</li>
<li>支持多个条件变量，好用</li>
<li>支持公平锁：先来先得</li>
<li>操作繁琐，更灵活。申请，释放可以不在同一段代码里</li>
</ul></li>
</ul></li>
<li>各种应用类
<ul class="org-ul">
<li>BlockingQueue
<ul class="org-ul">
<li>LinkedBlockingQueue: 基于链表实现的</li>
<li>SynchronzeBlockingQueue: 没有队列，直接发送给消费者</li>
<li>put：队列满了，线程阻塞</li>
<li>get: 队列空了，线程阻塞</li>
</ul></li>
<li>CountDownLatch: 一组线程等待某个事件</li>
<li>CyclicBarrier: 允许线程互相等待</li>
<li>Semaphore: 信号量，permit</li>
<li>FutureTask: get方法获得返回值，提交给ExecutorService</li>
</ul></li>

<li>线程安全的缓存： 
<ul class="org-ul">
<li>使用 ConcurrentHashMap</li>
<li>使用putIfAbsent等复合操作</li>
<li>把运算的结果包装成FutureTask, 避免重复计算</li>
</ul></li>

<li>悲观锁和乐观锁
<ul class="org-ul">
<li>悲观锁：基于互斥同步</li>
<li>乐观锁：基于冲突检测
<ul class="org-ul">
<li>CAS：Compare and Swap： 要设置的值A，旧值B，先判断要设置的是否是B，如果是则设置为A，反之什么都不做，返回B 
<ul class="org-ul">
<li>底层汇编支持</li>
<li>Atomic类</li>
<li>ABA问题：检查的时候仍然是A，但在这期间可能已经被改为B，再被改成A
<ul class="org-ul">
<li>AtomicStampedReference</li>
<li>使用锁</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>

<li>JMM
<ul class="org-ul">
<li>线程内存</li>
<li>共享内存</li>
<li>读写操作</li>
</ul></li>

<li>volatile
<ul class="org-ul">
<li>可见性，改动完毕所有线程可见，不会被缓存在当前线程可见的内存中</li>
<li>前提：
<ul class="org-ul">
<li>当前线程完成计算</li>
<li>变量不参与其他约束</li>
</ul></li>
<li>两次判断来实现不同类</li>
</ul></li>

<li>锁优化：
<ul class="org-ul">
<li>锁消除：自动判断是否需要加锁，比如在synchronize的方法中使用了不变对象类</li>
<li>锁粗化：循环中如果多次获取同一个对象的锁，可优化在循环外加锁</li>
<li>轻量级锁：用CAS代替内置锁
<ul class="org-ul">
<li>对象头的Mark Word</li>
</ul></li>
<li>锁偏向：偏心于第一个获取对象锁的线程，这个对象可以直接进行操作</li>
<li>锁自旋：用一个忙等待来代替加锁，在加锁时间很短暂的情况下</li>
</ul></li>

<li>线程模型：
<ul class="org-ul">
<li>内核：1:1 实现简单，效率差，windows, linux</li>
<li>用户：实现困难甚至很难完毕，比如阻塞一个线程，是否要阻塞jvm进程等</li>
<li>混合式：solaris</li>
</ul></li>

<li>servlet是否线程安全：不安全。使用线程池</li>
</ul>
</div>
</div>

<div id="outline-container-org174e154" class="outline-3">
<h3 id="org174e154">jvm</h3>
<div class="outline-text-3" id="text-org174e154">
<ul class="org-ul">
<li>jvm内存模型
<ul class="org-ul">
<li>stack</li>
<li>方法区</li>
<li>heap</li>
<li>direct access area</li>
</ul></li>
<li>jvm问题工具,jps,jinfo,jmap, jstack&#x2026;</li>
<li>class loader 
<ul class="org-ul">
<li>双亲委派，一直往上调用，直到父亲无法加载，向下分派</li>
<li>BootStrap：jvm</li>
<li>Extension：rt/ext目录</li>
<li>Application</li>
<li>自定义</li>
</ul></li>
<li>GC
<ul class="org-ul">
<li>GC root: 
<ul class="org-ul">
<li>虚拟机栈(栈帧中的 <span class="underline">本地变量表</span> )中引用的对象</li>
<li>方法区中 <span class="underline">类静态属性</span> 引用的对象</li>
<li>方法区中 <span class="underline">常量引用</span> 的对象</li>
<li>本地方法栈中 <span class="underline">JNI(native方法)引用</span> 的对象</li>
</ul></li>
<li>算法：
<ul class="org-ul">
<li>标记-清除</li>
<li>标记-整理</li>
<li>复制</li>
</ul></li>
<li>垃圾回收器：
<ul class="org-ul">
<li>新生代：
<ul class="org-ul">
<li>Serial：客户程序</li>
<li>ParNew：并行</li>
<li>Parallel Scavenge：有利于吞吐量</li>
<li>G1：大内存</li>
</ul></li>
<li>老生代： 
<ul class="org-ul">
<li>CMS：初始标记 GC root, 并发分析可达性，重新标记（改动检查），并发清除
<ul class="org-ul">
<li>并发好，停顿短</li>
<li>产生大量碎片</li>
</ul></li>
<li>Serial Old（MSC）</li>
<li>Parallel Old</li>
<li>G1</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org953893c" class="outline-3">
<h3 id="org953893c">spring</h3>
<div class="outline-text-3" id="text-org953893c">
<ul class="org-ul">
<li>ioc,aop原理
<ul class="org-ul">
<li>依赖注入：帮助初始化对应的对象，需要在取</li>
<li>aop: 面向切面编程，集中处理某些逻辑
<ul class="org-ul">
<li>dynanmic proxy
<ul class="org-ul">
<li>只能针对接口</li>
<li>重新编译一个对象，加上对应的代码</li>
</ul></li>
<li>assembler技术</li>
</ul></li>
</ul></li>
<li>ioc初始化流程</li>
<li>springmvc的流程</li>
<li>springboot
<ul class="org-ul">
<li>starter</li>
</ul></li>
<li>spring cloud相关组件
<ul class="org-ul">
<li>zuul</li>
<li>eureka</li>
<li>feign</li>
<li>ribbon</li>
<li>config server</li>
<li>hystrix</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfa6a4c3" class="outline-2">
<h2 id="orgfa6a4c3">database</h2>
<div class="outline-text-2" id="text-orgfa6a4c3">
<ul class="org-ul">
<li>索引及底层实现 B*, B+</li>
<li>索引失效的场景：计算</li>
<li>最左原则</li>
<li>查看执行计划</li>
<li>carndiation</li>
<li>锁的类型，行级表级</li>
<li>悲观，乐观锁</li>
<li>数据库事物及特性
<ul class="org-ul">
<li>ACID
<ul class="org-ul">
<li>原子性</li>
<li>一致性</li>
<li>隔离性</li>
<li>持久性
<ul class="org-ul">
<li>redo，undo</li>
</ul></li>
</ul></li>
<li>隔离级别：
<ul class="org-ul">
<li>read uncommited：脏读，没有提交机制</li>
<li>read commited: 不可重复读，一次事务里面读取的数据可能不一致(orcale)</li>
<li>read repeatable: 幻影读：事务A更新了某张表全部数据，但是另外一个事务B同时插入了一条新的记录，对于事务A这条数据是幻影(mysql)</li>
<li>serialable：一般在应用层控制</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5362b27" class="outline-2">
<h2 id="org5362b27">network</h2>
<div class="outline-text-2" id="text-org5362b27">
</div>
<div id="outline-container-org1b1ace4" class="outline-3">
<h3 id="org1b1ace4">web</h3>
<div class="outline-text-3" id="text-org1b1ace4">
<ul class="org-ul">
<li>session与cookie的区别</li>
<li>get和post区别
<ul class="org-ul">
<li>文件上传用post还是get</li>
</ul></li>
<li>session的存储
<ul class="org-ul">
<li>服务器上</li>
</ul></li>
<li>防止表单重复提交
<ul class="org-ul">
<li>session关联一个token</li>
<li>后台提交事务前校验token</li>
</ul></li>
<li>http和https的区别：利用SSL加密</li>
<li>短地址：
<ol class="org-ol">
<li>dns解析短域名</li>
<li>利用get获取真正的url</li>
<li>redirect到真正的url</li>
</ol></li>
<li>从浏览器输入网址的过程</li>
</ul>
</div>
</div>

<div id="outline-container-org555722e" class="outline-3">
<h3 id="org555722e">nginx</h3>
<div class="outline-text-3" id="text-org555722e">
<ul class="org-ul">
<li>负载均衡策略
<ul class="org-ul">
<li>轮询</li>
<li>权重</li>
<li>ip hash</li>
<li>url hash</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb471557" class="outline-3">
<h3 id="orgb471557">protocal</h3>
<div class="outline-text-3" id="text-orgb471557">
<ul class="org-ul">
<li>tcp3次握手和4次挥手</li>
<li>tcp和udp的区别</li>
<li>dns 
<ul class="org-ul">
<li>AName</li>
<li>PTR</li>
<li>host file</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbca60f0" class="outline-3">
<h3 id="orgbca60f0">NIO</h3>
<div class="outline-text-3" id="text-orgbca60f0">
<ul class="org-ul">
<li>select，poll, epoll</li>
<li>netty</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgffacc2d" class="outline-2">
<h2 id="orgffacc2d">distribution</h2>
<div class="outline-text-2" id="text-orgffacc2d">
<ul class="org-ul">
<li>2PC/3PC 
<ol class="org-ol">
<li>询问()</li>
<li>确认</li>
</ol></li>
<li>CAP
<ul class="org-ul">
<li>zookeeper ：CA</li>
<li>paxos
<ul class="org-ul">
<li>准备</li>
<li>批准</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgd9f98c4" class="outline-3">
<h3 id="orgd9f98c4">redis</h3>
<div class="outline-text-3" id="text-orgd9f98c4">
<ul class="org-ul">
<li>高可用：
<ul class="org-ul">
<li>主从：数据备份与读负载均衡
<ul class="org-ul">
<li>写操作无法负载均衡</li>
<li>存储能力受到单机的限制</li>
</ul></li>
<li>哨兵：自动化的故障恢复
<ul class="org-ul">
<li>写操作无法负载均衡</li>
<li>存储能力受到单机的限制</li>
</ul></li>
<li>集群： Redis 把所有的 Key 分成了 16384 个 slot
<ul class="org-ul">
<li>每个 Redis 实例负责其中一部分 slot</li>
<li>集群中的所有信息（节点、端口、slot等），都通过节点之间定期的数据交换而更新。</li>
</ul></li>
</ul></li>
<li>redis是单线程还是多线程：单线程
<ul class="org-ul">
<li>没有线程切换开销，没有加锁</li>
<li>单个操作慢会极其降低效率</li>
</ul></li>
<li>缓存穿透怎么解决：缓存NULL</li>
<li>数据结构：
<ul class="org-ul">
<li>string</li>
<li>list</li>
<li>set</li>
<li>sorted set</li>
<li>hash</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0cbc613" class="outline-3">
<h3 id="org0cbc613">db</h3>
<div class="outline-text-3" id="text-org0cbc613">
<ul class="org-ul">
<li>一致性hash算法</li>
<li>分库分表：使用MultpleDataSource</li>
<li>分布式锁: 
<ul class="org-ul">
<li>redis：原子操作 :  SETNX key value 1000</li>
<li>mysql : 版本号字段</li>
<li>zookeeper</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2381948" class="outline-3">
<h3 id="org2381948">rabbit mq</h3>
<div class="outline-text-3" id="text-org2381948">
<ul class="org-ul">
<li>exchange
<ul class="org-ul">
<li>fanout: 广播</li>
<li>direct: 根据routing key 进行路由</li>
<li>topic：多个条件变量</li>
<li>default：匿名，根据binding</li>
</ul></li>
<li>queue：
<ul class="org-ul">
<li>持久性</li>
<li>消息确认</li>
<li>有界性</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org44a0556" class="outline-2">
<h2 id="org44a0556">k8s</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
